안녕하세요.
이번시간에는 XXX 에 대해서 살펴보도록 하겠습니다.

# Pandas 데이터 처리
- 요약과 통계연산
- 함수적용 (map, apply)
- agg()
- 손실데이터처리
- 데이터 결합

판다스(Pandas) 데이터프레임은 데이터를 효율적으로 요약하고 통계 연산을 수행하는 다양한 기능을 제공합니다.
이를 통해 데이터를 빠르게 탐색하고 데이터의 분포, 중심 경향성, 상관 관계 등을 파악할 수 있습니다.
주요한 요약 및 통계 연산에 대한 설명은 다음과 같습니다

예제코드를 통해서 간략하게 확인해보도록 하겠습니다.

# 요약과 통계연산

판다스(Pandas) 데이터프레임은 데이터를 효율적으로 `요약`하고 `통계 연산`을 수행하는 다양한 기능을 제공합니다.  
이를 통해 데이터를 빠르게 탐색하고 데이터의 분포, 중심 경향성, 상관 관계 등을 파악할 수 있습니다.  
주요한 요약 및 통계 연산에 대한 설명은 다음과 같습니다:

1. 데이터프레임의 기본 정보 확인하기

|이름|설명|
|--|--|
|head() 및 tail()| 데이터프레임의 처음 몇 개 또는 마지막 몇 개 행을 확인합니다.|
|info()| 데이터프레임의 기본 정보를 확인합니다. 열의 이름, 데이터 타입, 누락된 값의 개수 등을 출력합니다.|
|describe()| 데이터프레임의 기술 통계 요약을 제공합니다. 수치형 열에 대한 개수, 평균, 표준 편차, 최소값, 백분위수 등을 출력합니다.|

2. 열별 요약 통계 연산

|이름|설명|
|--|--|
|mean(), median(), min(), max()| 각 열의 평균, 중앙값, 최소값, 최대값을 계산합니다.|
|sum()| 각 열의 합을 계산합니다.|
|std()| 각 열의 표준 편차를 계산합니다.|
|count()| 각 열의 비누락값(NaN)이 아닌 값의 개수를 계산합니다.|


3. 행별 요약 통계 연산

|이름|설명|
|--|--|
|sum(axis=1)| 각 행의 합을 계산합니다.|
|mean(axis=1)| 각 행의 평균을 계산합니다.|
|median(axis=1)| 각 행의 중앙값을 계산합니다.|

우선 실습을 위한 데이터프레임 객체를 생성해봅니다.

In [1]:
"""
head(), tail(), info(), describe(), 
"""
import pandas as pd

# 데이터 생성
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [None, 30, 35, 28],
        'Gender': ['Female', 'Male', 'Male', 'Male'],
        'Height': [165, 180, 175, 170]}
df = pd.DataFrame(data)
df

      Name   Age  Gender  Height
0    Alice   NaN  Female     165
1      Bob  30.0    Male     180
2  Charlie  35.0    Male     175
3    David  28.0    Male     170

head() 메소드를 사용하면 데이터프레임의 앞쪽에 있는 데이터 들을 확인할 수 있습니다.

In [2]:
df.head(2)

    Name   Age  Gender  Height
0  Alice   NaN  Female     165
1    Bob  30.0    Male     180

head() 메소드를 사용하면 데이터프레임의 뒤쪽에 있는 데이터 들을 확인할 수 있습니다.

In [3]:
df.tail(2)

      Name   Age Gender  Height
2  Charlie  35.0   Male     175
3    David  28.0   Male     170

이번에는 데이터프레임에서의 idxmax, idxmin, cumsum 메소드에 대해서 알아보겠습니다.

In [4]:
"""
idxmax(), idxmin(), cumsum(),
"""
import pandas as pd

# 데이터 생성
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 21],
        'Gender': ['Female', 'Male', 'Male', 'Male'],
        'Height': [165, 180, None, 170]}
df = pd.DataFrame(data, index=list("ABCD"))


df

      Name  Age  Gender  Height
A    Alice   25  Female   165.0
B      Bob   30    Male   180.0
C  Charlie   35    Male     NaN
D    David   21    Male   170.0

이번에는 idxmax() 에 대해서 알아보도록 하겠습니다.

In [5]:
print(df.Age.sort_values(ascending=False))
df.Age.idxmax()

C    35
B    30
A    25
D    21
Name: Age, dtype: int64

'C'

위의 예제 코드의 결과를 보면 Age 컬럼에서 가장 큰 값인 35의 index 인 "C"를 얻을 수 있습니다.

이번에는 idxmin() 에 대해서 알아보도록 하겠습니다.

In [6]:
print(df.Age.sort_values())
df.Age.idxmin()

D    21
A    25
B    30
C    35
Name: Age, dtype: int64

'D'

위의 예제 코드의 결과를 보면 Age 컬럼에서 가장 작은 값인 21의 index 인 "D"를 얻을 수 있습니다.

이번에는 누적합을 구할때 사용하는 cumsum() 메소드에 대해서 알아보도록 하겠습니다.

In [7]:
df1 = pd.concat([df.Age, df.Age.cumsum()], axis=1)
df1.columns = ["Age", "cumsum"]
df1

   Age  cumsum
A   25      25
B   30      55
C   35      90
D   21     111

위의 코드는 Age 열의 시리즈와 Age에서 cumsum()을 호출한 결과로 나오는 시리즈를
판다스의 concat 함수를 통해 열방향으로 결합한후
그 결과롤 생성된 데이터 프레임의 이름을 Age, cumsum으로 변경해준 것입니다.
결과를 보면 cumsum은 Age에 대한 누적합이 기록된것을 확인할 수 잇습니다.

수치형 데이터로만 구성되어 있는 데이터 프레임 객체에 idxmax()를 호출한 경우에는
각 컬럼별로 idxmax() 값이 할당된 Series객체를 리턴합니다.

In [8]:
# 수치형 데이터로만 이루어진 Dataframe 에도 적용 가능
df1= df[["Age", "Height"]]
df1

   Age  Height
A   25   165.0
B   30   180.0
C   35     NaN
D   21   170.0

In [9]:
df1.idxmax()

Age       C
Height    B
dtype: object

위의 예제에서는 Age의 경우 가장큰 값이 35가 있는 C가
Height에는 가장큰 값이 180이 있는 "B" 가 
해당 컬럼명을 인덱스로한 value 에 시리즈로 생성된 것을 볼 수 있습니다.

만약 수치형 데이터 이외에 다른 타입의 데이터가 포함되어 있는
데이터프레임에서 idxmax()를 호출하면 아래와 같은 에러메시지가 나옵ㄴ디ㅏ.

In [10]:
df.idxmax()

TypeError: reduction operation 'argmax' not allowed for this dtype

판다스의 시리즈에서는 
가장 높은 값의 순서 인덱스를 확인할 수 있는
argmax() 메소드를 제공하는 반면

In [ ]:
df.Age.argmax()

데이터 프레임에서는 argmax()는 제공하지 않습니다.

idxmax()를 활용하여 가장 나이가 많은 사람의 이름을 확인하는 방법을 살펴보겠습니다.

In [11]:
# 가장 나이가 많은 사람은 누구인가?
df.loc[df.Age.idxmax(), "Name"]

'Charlie'

df.Age.idxmax()는 Age 컬럼에서 가장 큰 수의 인덱스를 반환하기 때문에
df.loc[] 인덱서에 해당 행의 라벨과 확인하고자 하는 정보가 있는 컬럼인 "Name"을 입력해주면
나이가 가장 많은 행의 Name 컬럼 값
즉 나이가 가장 많은 사람의 이름을 확인할 수 있습니다.

그리고 다음과 같은 방법도 가능합니다.
.loc 인덱서의 경우 대괄호 안에 행을 입력해서
해당 행의 시리즈를 얻고 해당 시리즈의 Name 인덱스의 값이 Chalie 를 리턴하는 절차입니다.

In [12]:
df.loc[df.Age.idxmax()]["Name"]

'Charlie'

그리고 시리지의 경우에도 인덱스의 값을 가져오기 위하여 .하고 인덱스명을 입력하면
해당 시리즈 객체의 속성에 접근 하는 방식으로 가능합니다.

In [13]:
df.loc[df.Age.idxmax()].Name

'Charlie'

위에서 보신바와 같이 DataFrame 에서 원하는 데이터를
조회하는 방법은 다양하기 때문에
각 방식에 대해서 데이터가 어떤 방식으로 어떤 데이터 타입으로 연결되는지를 이해하고
자신에게 가장 편한 방법으로 익혀두시면 좋습니다.

판다스(Pandas)의 DataFrame에서 map() 메서드는 Series에 적용된 값에 대해 
함수를 사용하여 각 값에 대한 변환을 수행하는 기능을 제공합니다. 
map() 메서드는 주로 특정 열의 값을 다른 값으로 매핑하거나 변환하는데 사용됩니다.

# 함수적용 (map)

판다스(Pandas)의 DataFrame에서 `map()` 메서드는 Series에 적용된 값에 대해   
지정된 사전(dict)이나 함수를 사용하여 각 값에 대한 변환을 수행하는 기능을 제공합니다.   
map() 메서드는 주로 특정 열의 값을 다른 값으로 매핑하거나 변환하는데 사용됩니다.

Gender 컬럼의 Female은 0, Male은 1로 변환을 해야 하는 미션이 생겼다고 가정하고,
map을 통해서 미션을 수행하는 예제를  살펴보도록 하겠습니다.
우선 실습을 위한 데이터 프레임을 만들어 보겠습니다.

In [14]:
# '성별' 열의 값에 매핑을 적용하여 숫자로 변환
#  Gender 컬럼의 Female은 0, Male은 1로 변환

import pandas as pd

# 데이터 생성
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, None],
        'Gender': ['Female', 'Male', 'Male', 'Male'],
        'Height': [165, 180, 175, 170]
}

df = pd.DataFrame(data, index=list("ABCD"))
df

      Name   Age  Gender  Height
A    Alice  25.0  Female     165
B      Bob  30.0    Male     180
C  Charlie  35.0    Male     175
D    David   NaN    Male     170

우선 딕셔너리를 활용해보도록 하겠습니다.

In [15]:
gender_mapping = {'Female': 0, 'Male': 1}

우선 파이썬의 딕셔너리에 대해서 잠시 살펴보도록 하겠습니다.

In [16]:
# [참고] dictionary 활용
x = "Female"
print(gender_mapping[x])
print(gender_mapping.get(x))

0
0

파이썬의 딕셔너리는 대괄호에 키를 넣어주거나
.get 함수를 통해서 키를 넣어주는 방식으로
해당 키에 매핑되는 값을 얻어 올 수 있습니다.

이제는 map 함수에 대해서 살펴보겠습니다.
map 함수는 시리즈의 객체에서 호출할 수 있으며,
map 인자에는 하나의 인자를 갖는 함수를 넣어주면 됩니다.
그러면 해당 시리즈의 모든 요소마다 인자로 넣어준 함수에 파라미터로 넣어주고
그 결과들을 모아서 시리즈를 생성하게 됩니다.

아래의 예를 통해서 설명해보도록 하겠습니다.

In [17]:
df.Gender.map(gender_mapping.get)

A    0
B    1
C    1
D    1
Name: Gender, dtype: int64

우선 Gender 컬럼으로 시리즈를 생성한 후
각 요소인 Female, Male, Male, Male 값을 순차적으로 gender_mapping.get 함수에 인자로 넣어줍니다.
그러면 해당 키에 매핑되는 값인 0, 1, 1, 1 을 구성요소로하는 시리즈를 만들게 됩니다.
그리고 각 구성요소의 인덱스가 그대로 새로 생성되는 series에 들어가게 됩니다.

In [18]:
df.Gender

A    Female
B      Male
C      Male
D      Male
Name: Gender, dtype: object

func = gender_mapping.get
pd.Series(
    [func(v) for v in df.Gender.values], 
    index = df.Gender.index
)

판다스의 시리즈에 열을 추가하는 방법은
대괄호에 열이름을 넣어주고 기존의 데이터프레임의 각행의 인덱스와 대응되는 인덱스를 가진
시리즈 객체를 넣어주는 방식입니다.

In [19]:
df['Gender2'] = df.Gender.map(gender_mapping)
df

      Name   Age  Gender  Height  Gender2
A    Alice  25.0  Female     165        0
B      Bob  30.0    Male     180        1
C  Charlie  35.0    Male     175        1
D    David   NaN    Male     170        1

위의 코드에서 df.Gender.map(gender_mapping)의 결과는 df의 인덱스를 가진 시리즈 이므로,
Gender2 라는 필드에 Female을 0으로 Male을 1로 변환한 결과자 잘 들어가 있는것을 확인할 수 있습니다.

판다스의 map() 에는 람다함수가 많이 활용됩니다.
아래와 같은 방식의 lambda를 적용하여 미션을 완성할 수 있습니다.

In [20]:
# lambda 적용
df.Gender.map(lambda x: 0 if x == "Female" else 1)

A    0
B    1
C    1
D    1
Name: Gender, dtype: int64

lmabda에 대해서 조금더 자세히 들어가보도록 하겠습니다.

우선 파라미터로 받은 x에 대해서 Female 이면 0, Male이면 1을 리턴하는 함수가 있고
이 함수의 이름은 convert 라고 정의했다고 하보겠습니다.

In [21]:
def convert(x):
    return 0 if x == "Female" else 1    # (x=="Female")? 1: 0

위의 코드에서 dictionary 대신 이코들 사용해도 결과는 동일하겠지요.

In [22]:
df.Gender.map(convert)

A    0
B    1
C    1
D    1
Name: Gender, dtype: int64

이경우 함수가 매우 간단하므로 함수의 구현부를 별도의 이름으로 선언하지 않고
바로 map에 파라미터로 넣어줄 수 있습니다.
이때 이것이 익명함수리는 이름으로 lambda라고 해주고,
파라미터로 받는 값을 x라고 명명한다는 의미에서 lambda x라고 써주고,
lambda x옆에 콜론을 써준 다음 
해당 함수의 return 이후에 들어가는 내용을 써주면 됩니다.

In [23]:
df.Gender.map(lambda x: 0 if x == "Female" else 1)

A    0
B    1
C    1
D    1
Name: Gender, dtype: int64

lambda 에 대한 이해를 돕기위한 추가 예제 입니다.
이 경우 해당 시리즈의 요소를 x로 받아서 
x+10을 리턴하여 그 것을 모아서 시리즈 객체를 만들게 됩니다.

In [24]:
# lambda 추가 예제
print(df.Age)
print(df.Age.map(lambda x: x + 10))

A    25.0
B    30.0
C    35.0
D     NaN
Name: Age, dtype: float64
A    35.0
B    40.0
C    45.0
D     NaN
Name: Age, dtype: float64

위 코드의 실행된 결과를 보면, 기존의 Age에 10이 더한 값이 나온것을 확인할 수 있습니다.

이 미션에 대해서 map을 쓰지 않고 np.where를 사용하는 방법에 대해서도 간략하게 짚어보도록 하겠습니다.

In [25]:
print(df)
import numpy as np
pd.Series(
    np.where(df.Gender=="Female", 0, 1),
    index=df.index
)

      Name   Age  Gender  Height  Gender2
A    Alice  25.0  Female     165        0
B      Bob  30.0    Male     180        1
C  Charlie  35.0    Male     175        1
D    David   NaN    Male     170        1

A    0
B    1
C    1
D    1
dtype: int64

df.Gender가 Female일 경우에는 0, 그렇지 않을 경우에는 1을 값을 가지는 
ndarray 객체를 만들고
그것을 기반으로 기존의 df의 index를 index 인자로 넣어서
Series를 생성해주는 방식으로 할 수 있습니다.

이번에는 apply 함수에 대해서 알아보도록 하겠습니다.

pandas의 DataFrame에서 apply() 메서드는 열(column) 또는 행(row) 단위로 함수를 적용하여 데이터를 변환하는 기능을 제공합니다. 
apply() 메서드는 특정 함수를 데이터프레임의 모든 열 또는 각 행에 적용하며, 
이를 통해 데이터의 변환, 필터링, 정제 등 다양한 작업을 수행할 수 있습니다.

이중 func, axis 파라미터에 대해서 살펴보면,
func: 적용하고자 하는 함수를 지정합니다. 사용자 정의 함수나 내장 함수 등 모두 가능합니다. 해당 함수에는 series 객체가 인자로 들어가게 됩니다.
axis: 0이면 함수가 열(column)에 적용됩니다. 1이면 함수가 행(row)에 적용됩니다.

# 함수적용 (apply)

pandas의 DataFrame에서 apply() 메서드는 열(column) 또는 행(row) 단위로 함수를 적용하여 데이터를 변환하는 기능을 제공합니다. apply() 메서드는 특정 함수를 데이터프레임의 모든 열 또는 각 행에 적용하며, 이를 통해 데이터의 변환, 필터링, 정제 등 다양한 작업을 수행할 수 있습니다.

```python
DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwds)
```

- `func`: 적용하고자 하는 함수를 지정합니다. 사용자 정의 함수나 내장 함수 등 모두 가능합니다.
- `axis`: 0이면 함수가 열(column)에 적용됩니다. 1이면 함수가 행(row)에 적용됩니다.
- `raw`: True이면 행 또는 열을 배열로 전달하고, False이면 Series로 전달합니다.
- `result_type`: 반환되는 결과의 데이터 타입을 지정합니다.
- `args`: 함수에 추가적인 인자를 전달할 경우 사용합니다.

예제를 통해 알아보도록 하겠습니다.
이번 예제는 각 열에 대해 최대값을마지막 행에 삽입하는 것입니다.
일단 3행 5열의 데이터 프레임을 만들어보도록 하겠습니다.

In [26]:
"""
각 열의 최대값을 마지막 행에 삽입
"""

import pandas as pd
import numpy as np

# 데이터 생성
data = np.random.choice(range(1,16), 15, replace=False).reshape(3,5)
df = pd.DataFrame(data, index="R1 R2 R3".split(), columns="C1 C2 C3 C4 C5".split())
df

    C1  C2  C3  C4  C5
R1   8   9  12  13   1
R2  11  14  10  15   2
R3   7   3   6   5   4

apply() 함수는 데이터 프레임에서 호출되며
인자로 들어가는 함수는 Series 객체를 파라미터로 받으며 호출이 됩니다.

그래서 apply에 인자로 넣어주는 함수를 
아래와 같이 Series를 받아서 그중에 max()를 호출하는 함수를 만들어서
find_max라는 이름으로 정의하였습니다.

그런후 df.apply를 호출하면서 해당 함수를 호출하였습니다.
이때 열 단위로 계산하기 위하여 axis=0으로 넣어주었는데,
axis파라미터 의 default value는 0 이므로
넣어주지 않아도 무방합니다.

In [27]:
# 각 열에 대해 최대값을 찾는 함수 정의
def find_max(s: pd.Series):
    return s.max()

df.apply(find_max, axis=0)

C1    11
C2    14
C3    12
C4    15
C5     4
dtype: int64

위의 예제에서 apply함수를 호출하면
데이터프레임 df의 각 열들에 해당하는 시리즈 객체들을 findx_max에 넣어주고
컬럼이름을 인덱스 find_max()의 리턴값을 밸류로 하는 시리지 객체를 만들어 줍니다.

# apply 동작 개요 (axis=0)
func=find_max
pd.Series(
    [func(df[x]) for x in df.columns],
    index = df.columns
)

위에서 생성된 각 열의 max값드르이 series를 마지막행에 추가해보도록 하겠습니다.

In [28]:
df

    C1  C2  C3  C4  C5
R1   8   9  12  13   1
R2  11  14  10  15   2
R3   7   3   6   5   4

데이터 프레임에 행을 추가 하기 위해서는
loc[] 인덱서에 삽입할 행의 index를 를 넣어주고 Series 객체를 어사인하면 됩니다.

In [29]:
df.loc["MAX"] = df.apply(find_max, axis=0)
df

     C1  C2  C3  C4  C5
R1    8   9  12  13   1
R2   11  14  10  15   2
R3    7   3   6   5   4
MAX  11  14  12  15   4

그러면 위와 같이 마지막 행에 MAX 라는 인덱스로 각 열의 최대값이 추가된 것을 확인할 수 있습니다.

위의 예제를 lambda를 활용해서 다시 정리해보도록 하겠습니다.

In [30]:
df.loc["MAX"] = df.apply(lambda x: x.max())
df

     C1  C2  C3  C4  C5
R1    8   9  12  13   1
R2   11  14  10  15   2
R3    7   3   6   5   4
MAX  11  14  12  15   4

이번에는 각 행의 최대값과 최소값으 차이를 구해서 마지막 열에 추가하는 것을 진행해보도록 하겠습니다.
우선 데이터 프레임을 만들어 보도록 하겠습니다.

In [31]:
"""
각 행의 최대, 최소 차이를 마지막 열에 추가
"""

import pandas as pd
import numpy as np

# 데이터 생성
data = np.random.choice(range(1,16), 15, replace=False).reshape(3,5)
df = pd.DataFrame(data, index="R1 R2 R3".split(), columns="C1 C2 C3 C4 C5".split())
df

    C1  C2  C3  C4  C5
R1   3   1   2  15   9
R2  14   5   6   7   4
R3   8  13  10  12  11

우선 각 행에서 최대값과 최소값의 차이를 계산하는 함수를 정의해보겠습니다.
이 함수는 Series를 인자로 받아서
최대값인 max()에서 최소값인 min()을 빼서 그 차이를 리턴하도록 하고
max_min_diff 라는 이름으로 정의하였습니다.

그리고 이 함수를 행단위로 적용하기 위해서는
apply를 호출할때 파라미터로 axis=1 을 넣어줍니다.
그러면 행단위로 최대값과 최소값의 차이에 대해서
각 행의 인덱스를 인덱스로하고, 차이값을 밸류로 하는 시리즈 객체를 리턴합니다.

In [32]:
# 각 행에서 최대값과 최소값의 차이를 계산하는 함수 정의
def max_min_diff(s: pd.Series):
    return s.max() - s.min()

df.apply(max_min_diff, axis=1)

R1    14
R2    10
R3     5
dtype: int64

# apply 동작 개요 (axis=1)
func=max_min_diff
pd.Series(
    [func(df.loc[idx]) for idx in df.index],
    index = df.index
)

데이터 프레임에 열을 추가 하기 위해서는
데이터프레임의 객체의 [] 에 삽입될 컬럼의 이름을 적어주고 
Series 객체를 어사인하면 됩니다.

In [33]:
df["MIN_MAX_DIFF"] = df.apply(max_min_diff, axis=1)
df

    C1  C2  C3  C4  C5  MIN_MAX_DIFF
R1   3   1   2  15   9            14
R2  14   5   6   7   4            10
R3   8  13  10  12  11             5

이번에는 lambda를 활용해보도록 하겠습니다.

In [34]:
df["MIN_MAX_DIFF"] = df.apply(lambda x: x.max() - x.min(), axis=1)
df

    C1  C2  C3  C4  C5  MIN_MAX_DIFF
R1   3   1   2  15   9            14
R2  14   5   6   7   4            10
R3   8  13  10  12  11             8

이번에는 필터링 기반으로 특정조건에 맞는 행 또는 열에 대해서만 
apply를 적용하는 방식에 대해서 알아보도록 하겠습니다.

데이터프레임에서 조건에 맞는 셀의 데이터에만 map과 apply를 적용하는 방법은  
loc 인덱싱을 사용하여 조건을 만족하는 행과 열을 선택한 후에  
해당 위치에 함수를 적용하면 됩니다.

## 필터링 기반 apply 적용


데이터프레임에서 조건에 맞는 셀의 데이터에만 map과 apply를 적용하는 방법은  
loc 인덱싱을 사용하여 조건을 만족하는 행과 열을 선택한 후에  
해당 위치에 함수를 적용하면 됩니다.

우선 예제를 위한 데이터 프레임을 생성해보겠습니다.

In [35]:
import pandas as pd

# 데이터 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Ella'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'London', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40    Berlin
4     Ella   45    London

Age가 35 이상인 행들의 'Age' 값을 10 증가시키는 예제입니다. 
이 경우 해당 하는 column 이 한개 이기 때문에 map()을 적용하여 해결 가능합니다.

In [36]:
# Age가 35 이상인 행들의 'Age' 값을 10 증가시킴 (map 적용)
df.loc[df['Age'] >= 35, 'Age'] = df.loc[df['Age'] >= 35, 'Age'].map(lambda x: x + 10)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   45     Paris
3    David   50    Berlin
4     Ella   55    London

몸무게가 70kg 이상인 경우에만 BMI를 계산하는 미션을 수행해보도록 하겠습니다.

In [37]:
"""
몸무게가 70kg 이상인 경우에만 BMI를 계산
 BMI 계산: weight / pow(height, 2)
"""

import pandas as pd
import numpy as np

# 데이터 생성
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Weight': [65, 70, 85, None],
        'Height': [1.65, 1.8, 1.75, 1.7]
}

df = pd.DataFrame(data)
df

      Name  Weight  Height
0    Alice    65.0    1.65
1      Bob    70.0    1.80
2  Charlie    85.0    1.75
3    David     NaN    1.70

In [38]:
df.loc[df.Weight>=70, "BMI"] = df[df.Weight>=70].apply(
    lambda x: np.round(x["Weight"] / (x["Height"])**2,1), 
    axis=1
)
df

      Name  Weight  Height   BMI
0    Alice    65.0    1.65   NaN
1      Bob    70.0    1.80  21.6
2  Charlie    85.0    1.75  27.8
3    David     NaN    1.70   NaN

In [39]:
df.loc[df.Weight>=70, "BMI"]

1    21.6
2    27.8
Name: BMI, dtype: float64

In [40]:
df[df.Weight>=70].apply(lambda x: np.round(x["Weight"] / (x["Height"])**2,1), axis=1)

1    21.6
2    27.8
dtype: float64

위의 예제에서는 loc 인덱서에 조건식을 주어 필터링 한 후에 apply를 호출하는 방식을 적용하였는데,
다음과 같이 apply()호출 전에 df를 loc 인덱서를 사용해서 필터링 해주지 않더라도
최종에는 동일한 결과를 얻을 수 있습니다.

In [41]:
df.loc[df.Weight>=70, "BMI"] = df.apply(
    lambda x: np.round(x["Weight"] / (x["Height"])**2,1), 
    axis=1
)
df

      Name  Weight  Height   BMI
0    Alice    65.0    1.65   NaN
1      Bob    70.0    1.80  21.6
2  Charlie    85.0    1.75  27.8
3    David     NaN    1.70   NaN

그 이유는 아래의 코드에서는 모든 행에 대해서 apply 를 적용하지만

In [42]:
s2 = df.apply(
    lambda x: np.round(x["Weight"] / (x["Height"])**2,1), 
    axis=1
)
s2

0    23.9
1    21.6
2    27.8
3     NaN
dtype: float64

실제로 assign을 할 때에는 좌측항에 있는 index와 일치 되는 값에 대해서만
대체되기 때문입니다.

In [43]:
df.loc[df.Weight>=70, "BMI"]

1    21.6
2    27.8
Name: BMI, dtype: float64

In [44]:
df.loc[df.Weight>=70, "BMI"] = s2
df

      Name  Weight  Height   BMI
0    Alice    65.0    1.65   NaN
1      Bob    70.0    1.80  21.6
2  Charlie    85.0    1.75  27.8
3    David     NaN    1.70   NaN

다만, 이경우에는 나중에 사용되지 않을 행까지 포함한 모든 행에 대해서
apply() 연산을 수행하기 때문에
수행속도에는 불리합니다.

이번에는 agg() 함수를 통해서 여러개의 집계함수를 동시에 적용하는 방법에 대해서 알아보도록 하겠습니다.
pandas에 내장된 함수는 아래와 같습니다.

## agg()
agg() 함수를 사용하면 여러 개의 집계 함수를 동시에 적용할 수 있으며, 그룹화된 데이터에서 원하는 다양한 집계 연산을 손쉽게 수행할 수 있습니다.

내장 집계 함수:

| 이름 | 기능 |
|--|--|
|mean()| 평균을 계산합니다.|
|sum()| 합계를 계산합니다.|
|min()| 최소값을 찾습니다.|
|max()| 최대값을 찾습니다.|
|count()| 데이터의 개수를 세어줍니다.|
|median()| 중앙값을 계산합니다.|
|std()| 표준편차를 계산합니다.|
|var()| 분산을 계산합니다.|
|quantile(q)| q-분위수를 계산합니다. (0 <= q <= 1)|

예제를 통해서 확인해보도록 하겠습니다.

우선 예제를 위한 데이터프레임을 생성하겠습니다.

In [45]:
import pandas as pd
import numpy as np
data = dict(
    Name="Alice Bob Charlie David".split(" "),
    Math=np.random.randint(50,100,4),
    Eng=np.random.randint(50,100,4),
)
df = pd.DataFrame(data, index=list("ABCD"))

df

      Name  Math  Eng
A    Alice    75   83
B      Bob    51   81
C  Charlie    99   55
D    David    57   78

agg 메소드는 모든 데이터가 수치형인 데이터프레임에 대해서만 적용이 가능합니다.
그래서 수치형 데이터인 열을 추출한 데이터 프레임을 만든후
agg()메소드를 호출합니다.
agg() 메소드를 호출할때 파라미터로는 호출할 집계합수를 문자열의 배열형태로 넣어줍니다.

In [46]:
df.iloc[:,1:].agg(["sum", "mean", "max"])

       Math     Eng
sum   282.0  297.00
mean   70.5   74.25
max    99.0   83.00

위의 예제에서 Math와 Eng의 컬럼에 대해서 
sum, mean, max의 집계함수의 결과를 호출한것을 확인할 수 있습니다.

transpose 를 활용해서
행 기준으로도 agg 함수를 통한 집계결과를 얻을 수 있습니다.

In [47]:
df.iloc[:,1:].T.agg(["sum", "mean", "max"])

          A      B      C      D
sum   158.0  132.0  154.0  135.0
mean   79.0   66.0   77.0   67.5
max    83.0   81.0   99.0   78.0

agg()의 파라미터는 내장 객체 뿐 아니라 사용자정의 함수도 입력할 수 있습니다.

In [48]:
def mean_squared_error(s):
    mean = s.mean()
    return (sum((s-mean)**2))**.5

In [49]:
df.iloc[:,1:].agg(["std", lambda x: x.idxmax(), mean_squared_error])

                         Math        Eng
std                 21.563859  12.996794
<lambda>                    C          A
mean_squared_error  37.349699  22.511108

위의 코드를 실행해 보면 내장집계함수인 std, 그리고 lambda, 그리고 mean_squared_error 함수를 파라미터로 넣어주었을때
각각의 결과가 행으로 나타나는 것을 볼 수 있습니다.

## 손실데이터 처리

누락된 값(결측치)을 적절한 값으로 대체하는 것입니다.  
판다스(Pandas)에서는 `fillna()` 메서드를 사용하여 누락된 값을 다른 값으로 채울 수 있습니다.

손실데이터 처리에 대해서 알아보도록 하겠습니다.
손실데이터 처리란 누락된 값(결측치)을 적절한 값으로 대체하는 것입니다.
판다스(Pandas)에서는 fillna() 메서드를 사용하여 누락된 값을 다른 값으로 채울 수 있습니다.

예제를 통해서 알아보도록 하겠습니다.
우선 예제코드를 위한 데이터 프레임을 생성하도록 하겠습니다.

In [50]:
import pandas as pd
import numpy as np

# 데이터 생성 (일부 값이 누락된 데이터)
data = [
    [1, 2, np.nan, 4, 5],
    [10, np.nan, 30, np.nan, 50],
    [100, 200, 300, np.nan, np.nan]
]

df = pd.DataFrame(
    data, 
    index=[f"R{i}" for i in range(len(data))],
    columns=[f"C{i}" for i in range(len(data[0]))]
)
df

     C0     C1     C2   C3    C4
R0    1    2.0    NaN  4.0   5.0
R1   10    NaN   30.0  NaN  50.0
R2  100  200.0  300.0  NaN   NaN

위의 데이터 프레임에서 NaN이라고 되어 있는 부분은 데이터가 없는 부분이고
결측치라고 불리우는 부분입니다.

우선 데이터 프레임에 결측치가 얼마나 있는지에 알아보는 방법에 대해서 확인해보도록 하겠습니다.

우선 df.info를 활용하는 방법입니다.
이경우에는 각 컬럼별로 결측치가 아닌 데이터의 갯수를 확인할 수 있습니다.

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, R0 to R2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C0      3 non-null      int64
 1   C1      2 non-null      float64
 2   C2      2 non-null      float64
 3   C3      1 non-null      float64
 4   C4      2 non-null      float64
dtypes: float64(4), int64(1)
memory usage: 144.0+ bytes

그리고 다른 방법은 isna()를 호출하는 방법입니다.
isna()는 결측치 일경우 True를 반환하게 됩니다.

In [52]:
df.isna()

       C0     C1     C2     C3     C4
R0  False  False   True  False  False
R1  False   True  False   True  False
R2  False  False  False   True   True

이를 기반으로 판다스 내장 집계햠수인 sum()을 활용하면 
각 행, 각 열 또는 데이터 프레임 전체에서의 결측치의 갯수를 알 수 있습니다.

In [53]:
# 각 열의 결측치 갯수
df.isna().sum()

C0    0
C1    1
C2    1
C3    2
C4    1
dtype: int64

In [54]:
# 각 행의 결측치 갯수
df.isna().sum(axis=1)

R0    1
R1    2
R2    2
dtype: int64

In [55]:
# 전체 결측치 개수
df.isna().sum().sum()

5

notna()는 결측치가 아닐 경우 True를 리턴합니다.

In [56]:
df.notna()

      C0     C1     C2     C3     C4
R0  True   True  False   True   True
R1  True  False   True  False   True
R2  True   True   True  False  False

결측치가 아닌 전체 데이터의 갯수를 구하는 방법입니다.

In [57]:
df.notna().sum()

C0    3
C1    2
C2    2
C3    1
C4    2
dtype: int64

In [58]:
df.notna().sum().sum()

10

describe()를 호출해보면 count 값이 결측치가 아닌 값들의 갯수임을 알 수 있습니다.

In [59]:
df.describe()

               C0          C1          C2   C3         C4
count    3.000000    2.000000    2.000000  1.0   2.000000
mean    37.000000  101.000000  165.000000  4.0  27.500000
std     54.744863  140.007143  190.918831  NaN  31.819805
min      1.000000    2.000000   30.000000  4.0   5.000000
25%      5.500000   51.500000   97.500000  4.0  16.250000
50%     10.000000  101.000000  165.000000  4.0  27.500000
75%     55.000000  150.500000  232.500000  4.0  38.750000
max    100.000000  200.000000  300.000000  4.0  50.000000

이번에는 fillna()를 사용하여 누락된 값을 대체하는 방법을 알아보도록 하겠습니다.

In [60]:
# 누락된 값을 0으로 대체
df2 = df.fillna(0)
df2

     C0     C1     C2   C3    C4
R0    1    2.0    0.0  4.0   5.0
R1   10    0.0   30.0  0.0  50.0
R2  100  200.0  300.0  0.0   0.0

df.fillna(0)를 호출하면 NaN 데이터가 
fillna()를 호출할때 파라미터로 넣었던 0으로 변경된 것을 확인할 수 있습니다.

fillna() 역시 원본데이터를 변경시키지는 않습니다.

In [61]:
df

     C0     C1     C2   C3    C4
R0    1    2.0    NaN  4.0   5.0
R1   10    NaN   30.0  NaN  50.0
R2  100  200.0  300.0  NaN   NaN

원본 데이터를 변화시키기 위해서는 inplace=True 파라미터를 넣어주면 됩니다.

In [62]:
df.fillna(0, inplace=True)
df

     C0     C1     C2   C3    C4
R0    1    2.0    0.0  4.0   5.0
R1   10    0.0   30.0  0.0  50.0
R2  100  200.0  300.0  0.0   0.0

이번에는 fillna()를 활용하여 누락된 값을 각 컬럼의 평균 값으로 대체해보도록 하겟습니다.
이때는 fillna의 파라미터에 df.mean()을 넣어주면 됩니다.

In [63]:
import pandas as pd
import numpy as np

# 데이터 생성 (일부 값이 누락된 데이터)
data = [
    [1, 2, np.nan, 4, 5],
    [10, np.nan, 30, np.nan, 50],
    [100, 200, 300, np.nan, np.nan]
]

df = pd.DataFrame(
    data, 
    index=[f"R{i}" for i in range(len(data))],
    columns=[f"C{i}" for i in range(len(data[0]))]
)
df

     C0     C1     C2   C3    C4
R0    1    2.0    NaN  4.0   5.0
R1   10    NaN   30.0  NaN  50.0
R2  100  200.0  300.0  NaN   NaN

In [64]:
# 누락된 값을 각 컬럼의 평균값으로 대체
print("df.mean(): ", df.mean())
df2 = df.fillna(df.mean())
df2

df.mean():  C0     37.0
C1    101.0
C2    165.0
C3      4.0
C4     27.5
dtype: float64

     C0     C1     C2   C3    C4
R0    1    2.0  165.0  4.0   5.0
R1   10  101.0   30.0  4.0  50.0
R2  100  200.0  300.0  4.0  27.5

위의 코드를 실행시켜 보면
각 결측치가 해당 컬럼의 평균값으로 입력되었음을 볼 수 있습니다.

이번에는 결측치를 바로 이전의 값으로 넣는 방법을 알아보도록 하겠습니다.
바로 이전 값으로 결측치를 채우기 위해서는
fillna를 호출할때 method="ffill" 을 파라미터로 넣어주면 됩니다.

In [65]:
# 누락된 값을 바로 앞의 값으로 대체 (forward fill)
df2 = df.fillna(method='ffill')
df2

     C0     C1     C2   C3    C4
R0    1    2.0    NaN  4.0   5.0
R1   10    2.0   30.0  4.0  50.0
R2  100  200.0  300.0  4.0  50.0

이번에는 두개 이상의 dataframe을 결합하는 방법에 대해서 알아보겠습니다.

# 데이터 결합하기

merge()와 concat()은 판다스(Pandas)에서  
데이터프레임을 합치는 데 사용되는 두 가지 중요한 메서드입니다.

**concat() 메서드:**  
concat() 메서드는 여러 개의 데이터프레임을  
행(axis=0) 또는 열(axis=1) 방향으로 합치는 데 사용됩니다.  
기본적으로 데이터프레임을 단순히 연결하여 합치는 기능을 제공합니다.

**concat() 메서드의 형식:**

```python
pd.concat(objs, axis=0, join='outer', ignore_index=False)
```
    
- `objs`: 합치려는 데이터프레임을 리스트 형태로 전달합니다.
- `axis`: 합치는 방향을 지정합니다. 0이면 행 방향, 1이면 열 방향입니다.
- `join`: 합치는 방식을 지정합니다. 기본값은 'outer'로, 합집합을 반환합니다.
- `ignore_index`: 기존 인덱스를 무시하고 새로운 인덱스를 생성하도록 지정합니다.

예제를 통해 concat 메소드의 활용방법에 대해서 알아보도록 하겠습니다.
우선 데이터프레임 객체들을 준비해보도록 하겠습니다.

In [66]:
"""

concat() 메서드의 axis 매개변수를 사용하여 
데이터프레임을 합칠 때 방향(행 또는 열)을 지정할 수 있습니다. 
axis 매개변수에는 0 또는 1을 입력할 수 있으며, 
각각 행 방향과 열 방향을 의미합니다.
"""
import pandas as pd

# 데이터 생성
data1 = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
}

data2 = {
    'Age': [25, 30],
    'City': ['New York', 'London']
}

df1 = pd.DataFrame(data1, index=list("ABC"))
df2 = pd.DataFrame(data2, index=list("AC"))

In [67]:
df1

   ID     Name
A   1    Alice
B   2      Bob
C   3  Charlie

In [68]:
df2

   Age      City
A   25  New York
C   30    London

두개의 데이터 프레임을 행 방향으로 합치는 예제입니다.
axis=0을 넣어주면 됩니다.
axis의 기본값을 0이므로 axis 파라미터를 생략하면 0의 값이 들어가게 됩니다.

In [69]:
# concat 메서드에서 axis=0을 사용하여 행 방향으로 합치기
pd.concat([df1, df2], axis=0)

    ID     Name   Age      City
A  1.0    Alice   NaN       NaN
B  2.0      Bob   NaN       NaN
C  3.0  Charlie   NaN       NaN
A  NaN      NaN  25.0  New York
C  NaN      NaN  30.0    London

데이터 프레임이 행 방향으로 합쳐진것을 볼 수 있으며, 
특정 칼럼에 대한 데이터가 없을 경우에는 NaN으로 채워져 있는 것을 확인할 수 있습니다.

이번에는 ignore_index를 True로 하였을경우를 확인해보겠습니다.

In [70]:
# igrnoe_index를 True로 하였을 경우
pd.concat([df1, df2], ignore_index=True)

    ID     Name   Age      City
0  1.0    Alice   NaN       NaN
1  2.0      Bob   NaN       NaN
2  3.0  Charlie   NaN       NaN
3  NaN      NaN  25.0  New York
4  NaN      NaN  30.0    London

이 코드를 실행하면 기존의 index인 A,B,C 값이 없어지고
자동증가 번호로 새로이 index가 채워져 있음을 볼 수 있습니다.

이번에는 concat을 호출할때 axis=1 을 인자로 넣어주어 
행방향으로 병합해보도록 하겠습니다.

In [71]:
pd.concat([df1, df2], axis=1)

   ID     Name   Age      City
A   1    Alice  25.0  New York
B   2      Bob   NaN       NaN
C   3  Charlie  30.0    London

이경우 열방향으로 데이터프레임을 결함하며
해당 데이터프레임의 index 기준으로 병합되는 것을 확인할 수 있습니다.

이번에는 concat을 호출할때 join 파라미터의 값을 통해서 
inner 또는 outer join 방식을 적용하는 방법에 대해서 알아보도록 하겠습니다.
join='outer': 기본값으로, 인덱스가 겹치지 않는 경우에는 빈 값(NaN)으로 처리되며, 
            인덱스가 겹치는 경우에는 합집합으로 합쳐집니다.
join='inner': 인덱스가 겹치는 경우에는 교집합으로 합쳐집니다.

In [72]:
"""
join:
join='outer': 기본값으로, 인덱스가 겹치지 않는 경우에는 빈 값(NaN)으로 처리되며, 
            인덱스가 겹치는 경우에는 합집합으로 합쳐집니다.
join='inner': 인덱스가 겹치는 경우에는 교집합으로 합쳐집니다.
"""
import pandas as pd

# 데이터 생성
data1 = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
}

data2 = {
    'ID': [2, 3, 4],
    'Age': [25, 30, 35]
}

df1 = pd.DataFrame(data1, index=list("ABC"))
df2 = pd.DataFrame(data2, index=list("ABD"))

In [73]:
df1

   ID     Name
A   1    Alice
B   2      Bob
C   3  Charlie

In [74]:
df2

   ID  Age
A   2   25
B   3   30
D   4   35

In [75]:
# concat 메서드에서 join='outer'를 사용하여 기본값으로 합치기
pd.concat([df1, df2], axis=1, join='outer')

    ID     Name   ID   Age
A  1.0    Alice  2.0  25.0
B  2.0      Bob  3.0  30.0
C  3.0  Charlie  NaN   NaN
D  NaN      NaN  4.0  35.0

이경우 병합되는 모든 데이터를 포함하는 데이터 프레임이 생성되게 됩니다.
일종의 합집합의 개념이며,
index 기준으로 병합하였을때 값이 없는 부분에 대해서는 NaN채워지게 됩니다.

In [76]:
# concat 메서드에서 join='inner'를 사용하여 교집합으로 합치기
pd.concat([df1, df2], axis=1, join='inner')

   ID   Name  ID  Age
A   1  Alice   2   25
B   2    Bob   3   30

이 경우 공통된 index가 있는 데이터에 대해서만 포함하게 됩니다.
일종의 교집합의 개념입니다.

이번에는 merge() 함수로 병합하는 방법에 대해서 알아보도록 하겠습니다.
concat이 데이터프레임의 인덱스 기준으로 병합하는 것과는 달리
merge()는 특정 칼럼의 값을 기준으로 병합하게 됩니다.

1. merge() 메서드:
merge() 메서드는 두 개의 데이터프레임을 특정 열(column)을 기준으로 합치는 데 사용됩니다. SQL의 JOIN 연산과 유사한 기능을 제공합니다.

merge() 메서드의 형식:

```python
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None)
```

- `left`: 왼쪽에 있는 데이터프레임을 지정합니다.
- `right`: 오른쪽에 있는 데이터프레임을 지정합니다.
- `how`: 합치는 방식을 지정합니다. 기본값은 'inner'로, 교집합을 반환합니다. `outer`, `left`, `right` 등이 가능합니다.
- `on`, `left_on`, `right_on`: 합치는 기준 열을 지정합니다.

예제를 통해 확인해보도록 하겠습니다.
우선 예제를 위한 데이터 프레임을 성생합니다.

In [77]:
import pandas as pd

# 데이터 생성
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
}

data2 = {
    'ID': [3, 4, 5, 6],
    'Age': [25, 30, 35, 40]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [78]:
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [79]:
df2

   ID  Age
0   3   25
1   4   30
2   5   35
3   6   40

'ID' 열을 기준으로 두 데이터프레임 합치는 방법입니다.
첫번째와 두번째 파라미터에는 결합하고자 하는 데이터프레임을 각각 넣어주고
on파라미터에는 합치는 기준이 되는 컬럼명을 입력합니다.
해당 컬럼의 내용이 같은 행끼리 결합하게 됩니다.

In [80]:
# 'ID' 열을 기준으로 두 데이터프레임 합치기 (inner join)
pd.merge(df1, df2, on='ID')

   ID     Name  Age
0   3  Charlie   25
1   4    David   30

위의 코드를 실행시켜 보면, df1, df2 에 공통으로 있는 ID인 3,4 에 대해서만 최종결과가 나온느것을 확인할 수 있습니다.

결합 방식에 대해서는 how 매개변수로 조정이 가능합니다.
(아래 내용 읽기)

how 매개변수를 사용하여 'inner', 'outer', 'left', 'right' 방식으로 두 데이터프레임을 합치는 방법

|매개변수|기능|
|--|--|
|'inner'| 두 데이터프레임의 'ID' 열을 비교하여 공통된 'ID' 값만 합칩니다.|
|'outer'| 두 데이터프레임의 모든 행을 합치며,  'ID' 값이 하나라도 있는 경우에는 해당 값을,  둘 다 없는 경우에는 NaN으로 처리합니다.|
|'left'| 첫 번째 데이터프레임 df1의 모든 행을 합칩니다.  두 데이터프레임의 'ID' 열을 비교하여 공통된 'ID' 값만 합치며, 'df1'의 모든 행은 보존됩니다.|
|'right'| 두 번째 데이터프레임 df2의 모든 행을 합칩니다.  두 데이터프레임의 'ID' 열을 비교하여 공통된 'ID' 값만 합치며, 'df2'의 모든 행은 보존됩니다.|

자세한 내용을 예제를 통해서 확인해보도록 하겠습니다.

아래의 코드는 'ID' 열을 기준으로 두 데이터프레임 합치는데,
how 파라미터로 outer를 입력합니다.

In [81]:
# 'ID' 열을 기준으로 두 데이터프레임 합치기 (outer join)
pd.merge(df1, df2, on='ID', how='outer')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      NaN  35.0
5   6      NaN  40.0

이 경우 df1, df2의 모든 행이 누락없이 데이터 프레임에 포함하는 방식으로
양쪽 모두에 공통으로 존재하지 않는 id를 가진 행도 포함이 되나,
이경우 컬럼값이 매핑이 되지 않는 경우에는 NaN 값으로 채워지게 됩니다.
예를 들어 첫번째 행의 경우 ID 1은 df1에만 존재하므로 Name 컬럼은 Alice라는 값으로 되어 있으나
Age 값은 df2에만 있고 df1에서는 존재하지 않는 컬럼이므로 해당 값은 NaN이 들어가게 됩니다.

다음은 how=left 파라미터로 merge를 호출하는 방법입니다.

In [82]:
# 'ID' 열을 기준으로 두 데이터프레임 합치기 (left join)
pd.merge(df1, df2, on='ID', how='left')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0

위의 결과를 보면 how=left로 인자를 입력하였을 경우
좌측편, 즉 첫번째 파라미터인 df1의 모든 행은 포함이 되고
해당 내용을 기준으로 ID열에 매핑이 되는 df2의 행만 포함이 되게 됩니다.
그래서 Alice, Bob 이 포함딘 행은 Age가 NaN으로 채워지게 됩니다.

다음은 how=right 파라미터로 merge를 호출하는 방법입니다.

In [83]:
# 'ID' 열을 기준으로 두 데이터프레임 합치기 (right join)
pd.merge(df1, df2, on='ID', how='right')

   ID     Name  Age
0   3  Charlie   25
1   4    David   30
2   5      NaN   35
3   6      NaN   40

위의 결과를 보면 how=rogjt로 인자를 입력하였을 경우
우측편, 즉 두번째 파라미터인 df2의 모든 행은 포함이 되고
해당 내용을 기준으로 ID열에 매핑이 되는 df1의 행만 포함이 되게 됩니다.
그래서 ID가 5로 되어 있는 행의 경우에는 Name에 NaN으로 채워지게 됩니다.

on, left_on, right_on은 merge() 메서드에서 사용되는 매개변수로, 
두 데이터프레임을 특정 열을 기준으로 합칠 때 해당 열들을 지정하는 역할을 합니다.

meger 하는 기준 컬럼의 이름이 양쪽 데이터 프레임에서 동일한 경우에는 on을 사용하면 되지만,

두 데이터프레임이 서로 다른 열 이름을 가지고 있을 때는
left_on, right_on 매개변수를 사용하여 왼쪽 데이터 프레임에서의 기준열과
오른쪽 데이터프레임에서의 기준 열을 각각 지정할 수 있습니다.

In [87]:
"""
on, left_on, right_on은 merge() 메서드에서 사용되는 매개변수로, 
두 데이터프레임을 특정 열을 기준으로 합칠 때 해당 열들을 지정하는 역할을 합니다.
left_on, right_on 매개변수를 사용하여 
두 데이터프레임이 서로 다른 열 이름을 가지고 있을 때도 쉽게 합치는 것이 가능합니다.
"""
import pandas as pd

# 데이터 생성
data1 = {
    'ID': [1, 2, 3],
    'Age': [25, 30, 35]
}

data2 = {
    'StudentID': [2, 3, 4],
    'Credit': [25, 30, 35]
}


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [88]:
df1

   ID  Age
0   1   25
1   2   30
2   3   35

In [89]:
df2

   StudentID  Credit
0          2      25
1          3      30
2          4      35

df1의 'ID'와 df2의 'StudentID' 열을 기준으로 두 데이터프레임 합치기 위해서는
left_on 에서는 첫번째 파라미터 즉 좌측이 되는 데이터프레임의 기준열인 "ID"를 넣어주고
right_ont 에서는 두번째 파라미터 즉 우측이 되는 데이터프레임의 기준열인 "StudentID"를 넣어줍니다.

In [90]:
# 'ID'와 'StudentID' 열을 기준으로 두 데이터프레임 합치기
pd.merge(df1, df2, left_on='ID', right_on='StudentID')

   ID  Age  StudentID  Credit
0   2   30          2      25
1   3   35          3      30

위의 코드의 실행결과를 보면 df1의 ID와 df2의 studentID가 일치할 경우 
데이터를 병합한 것을 확인할 수 있습니다.

이상으로 이번강의를 마치도록 하겠습니다.
수고하셨습니다.